### Brain Stock (Analysis & Preprocessing)

In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv(r"C:\Users\sujat\Downloads\Brain Stroke.csv")
data.head(2)

,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,Male,67.0,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,Male,80.0,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1

#### 1). Find the male and female those age is below 50 and they are working as self employee and gov. job.

In [3]:
data1=data.iloc[:,[0,1,5]]
data1.head(2)

  gender   age work_type
0   Male  67.0   Private
1   Male  80.0   Private

In [4]:
data2=data1.loc[(data1["age"]<50)]
data2.head(2)

    gender   age work_type
2   Female  49.0   Private
25    Male  42.0   Private

In [5]:
data3=data2.loc[(data2["work_type"]=="Govt_job")|(data2["work_type"]=="Self_employed")]
data3.head(2)

     gender   age work_type
28     Male  48.0  Govt_job
223  Female  44.0  Govt_job

In [6]:
data3["gender"].unique()

array(['Male', 'Female'], dtype=object)

#### 2)Find the female those are having heart disease problem and their bmi is 20-35.Â¶

In [7]:
dt1=data.iloc[:,[0,3,8]]
dt1.head(2)

  gender  heart_disease   bmi
0   Male              1  36.6
1   Male              1  32.5

In [8]:
dt2=dt1.loc[(dt1["gender"]=="Female")&(dt1["heart_disease"]==1)]
dt2.head(2)

    gender  heart_disease   bmi
9   Female              1  36.8
11  Female              1  28.2

In [9]:
dt3=dt2.loc[(dt2["bmi"]>20)&(dt2["bmi"]<35)]
dt3.head(2)

    gender  heart_disease   bmi
11  Female              1  28.2
29  Female              1  26.5

In [10]:
dt3["gender"].unique()

array(['Female'], dtype=object)

In [11]:
dt3["heart_disease"].unique()

array([1], dtype=int64)

#### Preprocessing

In [12]:
data.head(2)

,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,Male,67.0,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,Male,80.0,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1

In [13]:
data.isnull().sum()

gender               0
age                  0
hypertension         0
heart_disease        0
ever_married         0
work_type            0
Residence_type       0
avg_glucose_level    0
bmi                  0
smoking_status       0
stroke               0
dtype: int64

In [14]:
data["stroke"].value_counts()

0    4733
1     248
Name: stroke, dtype: int64

In [15]:
from sklearn.preprocessing import LabelEncoder
a=LabelEncoder()
data["gender"]=a.fit_transform(data["gender"])
data["ever_married"]=a.fit_transform(data["ever_married"])
data["work_type"]=a.fit_transform(data["work_type"])
data["Residence_type"]=a.fit_transform(data["Residence_type"])
data["smoking_status"]=a.fit_transform(data["smoking_status"])

In [16]:
x=data.iloc[:,:-1].values
y=data.iloc[:,-1].values

In [17]:
from sklearn .preprocessing import StandardScaler
sc=StandardScaler()
s1=sc.fit_transform(x)
s1

array([[ 1.18390850e+00,  1.04058433e+00, -3.26185770e-01, ...,
         2.72341090e+00,  1.19323816e+00, -3.53933192e-01],
       [ 1.18390850e+00,  1.61427033e+00, -3.26185770e-01, ...,
        -5.22766599e-04,  5.89389611e-01,  5.78839946e-01],
       [-8.44659868e-01,  2.46249882e-01, -3.26185770e-01, ...,
         1.44852918e+00,  8.69221866e-01,  1.51161308e+00],
       ...,
       [-8.44659868e-01,  6.97311148e-02,  3.06573766e+00, ...,
        -2.42364234e-01,  4.86293516e-01,  1.51161308e+00],
       [ 1.18390850e+00, -1.50917344e-01, -3.26185770e-01, ...,
        -4.88199415e-01,  2.21189274e-01,  1.51161308e+00],
       [-8.44659868e-01,  1.61427033e+00,  3.06573766e+00, ...,
        -4.92415000e-01,  8.86371531e-02,  5.78839946e-01]])

In [18]:
s2=pd.DataFrame(s1)
s2.head(2)

,0,1,2,3,4,5,6,7,8,9
0,1.183909,1.040584,-0.326186,4.136753,0.720137,-0.351534,0.983473,2.723411,1.193238,-0.353933
1,1.183909,1.614270,-0.326186,4.136753,0.720137,-0.351534,-1.016804,-0.000523,0.589390,0.578840